## Introduction to Pandas

In [ ]:
# creating a simple python list 
a=[1,4,3,7,2,6,3]
a

[1, 4, 3, 7, 2, 6, 3]

In [ ]:
# Now lets convert it into pandas object called a series
import pandas as pd
a=pd.Series(a)
a

0    1
1    4
2    3
3    7
4    2
5    6
6    3
dtype: int64

In [ ]:
type(a)

pandas.core.series.Series

## simple series operations such as sorting,max,min,sum,count

In [ ]:
a.min()

1

In [ ]:
a.max()

7

In [ ]:
a.sort_values()

0    1
4    2
2    3
6    3
1    4
5    6
3    7
dtype: int64

In [ ]:
a.sort_values(ascending=False,inplace=True)

In [ ]:
a.value_counts()

3    2
7    1
6    1
4    1
2    1
1    1
dtype: int64

In [ ]:
a[:1]

3    7
dtype: int64

In [ ]:
a.sort_values(ascending=False)

3    7
5    6
1    4
2    3
6    3
4    2
0    1
dtype: int64

In [ ]:
data={
    'apples':[3,2,0,1],
    'orange':[3,2,0,1]
}

In [ ]:
purchases=pd.DataFrame(data)
purchases

   apples  orange
0       3       3
1       2       2
2       0       0
3       1       1

In [ ]:
purchases=pd.DataFrame(data,index=['Dhoni','Varsha','Thanu','Abhi'])
purchases

        apples  orange
Dhoni        3       3
Varsha       2       2
Thanu        0       0
Abhi         1       1

## pandasdata frames

In [ ]:
  import pandas as pd
  file_name="/content/titanic.csv"
  df=pd.read_csv(file_name)

In [ ]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [ ]:
df.head(10)

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0
5       1                              Anderson, Mr. Harry  ...        S         1
6       1                Andrews, Miss. Kornelia Theodosia  ...        S         1
7       1                           Andrews, Mr. Thomas Jr  ...        S         0
8       1    Appleton, Mrs. Edward Dale (Charlotte Lamson)  ...        S         1
9       1                          Artagaveytia, Mr. Ramon  ...        C         0

[10 rows x 11 columns]

In [ ]:
df.describe()

            pclass          age  ...         fare     survived
count  1309.000000  1046.000000  ...  1308.000000  1309.000000
mean      2.294882    29.881135  ...    33.295479     0.381971
std       0.837836    14.413500  ...    51.758668     0.486055
min       1.000000     0.166700  ...     0.000000     0.000000
25%       2.000000    21.000000  ...     7.895800     0.000000
50%       3.000000    28.000000  ...    14.454200     0.000000
75%       3.000000    39.000000  ...    31.275000     1.000000
max       3.000000    80.000000  ...   512.329200     1.000000

[8 rows x 6 columns]

In [ ]:
df.columns

Index(['pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare',
       'cabin', 'embarked', 'survived'],
      dtype='object')

In [ ]:
df['name']

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [ ]:
df.to_csv("myDataFrame2.csv")
df.to_excel("myDataFrame2.xlsx")

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1046 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1308 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1307 non-null   object
 10  survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

In [ ]:
dict_df=pd.DataFrame({
    'http_status':[200,200,404,404,301],
    'response _time':[0.04,0.02,0.07,0.08,1.0]})
dict_df

   http_status  response _time
0          200            0.04
1          200            0.02
2          404            0.07
3          404            0.08
4          301            1.00

## examining our data frames

In [ ]:
#view the last 5 lines
df.tail(10)

      pclass                                     name  ... embarked  survived
1299       3                      Yasbeck, Mr. Antoni  ...        C         0
1300       3  Yasbeck, Mrs. Antoni (Selini Alexander)  ...        C         1
1301       3                     Youseff, Mr. Gerious  ...        C         0
1302       3                        Yousif, Mr. Wazli  ...        C         0
1303       3                    Yousseff, Mr. Gerious  ...        C         0
1304       3                     Zabour, Miss. Hileni  ...        C         0
1305       3                    Zabour, Miss. Thamine  ...        C         0
1306       3                Zakarian, Mr. Mapriededer  ...        C         0
1307       3                      Zakarian, Mr. Ortin  ...        C         0
1308       3                       Zimmerman, Mr. Leo  ...        S         0

[10 rows x 11 columns]

In [ ]:
df.describe()

            pclass          age  ...         fare     survived
count  1309.000000  1046.000000  ...  1308.000000  1309.000000
mean      2.294882    29.881135  ...    33.295479     0.381971
std       0.837836    14.413500  ...    51.758668     0.486055
min       1.000000     0.166700  ...     0.000000     0.000000
25%       2.000000    21.000000  ...     7.895800     0.000000
50%       3.000000    28.000000  ...    14.454200     0.000000
75%       3.000000    39.000000  ...    31.275000     1.000000
max       3.000000    80.000000  ...   512.329200     1.000000

[8 rows x 6 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1046 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1308 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1307 non-null   object
 10  survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

In [ ]:
df.dtypes

pclass        int64
name         object
sex          object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
cabin        object
embarked     object
survived      int64
dtype: object

In [ ]:
df.columns

Index(['pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare',
       'cabin', 'embarked', 'survived'],
      dtype='object')

In [ ]:
#PYNQ.io website for pynq archtecture

## indexing and selecting segments of our data frames

In [ ]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [ ]:
df.tail()

      pclass                       name     sex  ...  cabin  embarked  survived
1304       3       Zabour, Miss. Hileni  female  ...    NaN         C         0
1305       3      Zabour, Miss. Thamine  female  ...    NaN         C         0
1306       3  Zakarian, Mr. Mapriededer    male  ...    NaN         C         0
1307       3        Zakarian, Mr. Ortin    male  ...    NaN         C         0
1308       3         Zimmerman, Mr. Leo    male  ...    NaN         S         0

[5 rows x 11 columns]

In [ ]:
#df.loc[row_label,column_label]
df.loc[1308,"name"]

'Zimmerman, Mr. Leo'

In [ ]:
df.loc[1,'name']

'Allison, Master. Hudson Trevor'

In [ ]:
df.loc[:,"name"]

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [ ]:
df.loc[123,"name"]

'Frolicher-Stehli, Mr. Maxmillian'

In [ ]:
names=df.loc[:,"name"]

In [ ]:
names.head()

0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
Name: name, dtype: object

In [ ]:
#slicing a row
df.loc[0,:]

pclass                                  1
name        Allen, Miss. Elisabeth Walton
sex                                female
age                                    29
sibsp                                   0
parch                                   0
ticket                              24160
fare                              211.338
cabin                                  B5
embarked                                S
survived                                1
Name: 0, dtype: object

## slicing using iloc

In [ ]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [ ]:
df.iloc[0,1]

'Allen, Miss. Elisabeth Walton'

In [ ]:
df.iloc[0]

pclass                                  1
name        Allen, Miss. Elisabeth Walton
sex                                female
age                                    29
sibsp                                   0
parch                                   0
ticket                              24160
fare                              211.338
cabin                                  B5
embarked                                S
survived                                1
Name: 0, dtype: object

In [ ]:
#slicing multiple columns 
df.loc[:,["name","sex"]]

                                                 name     sex
0                       Allen, Miss. Elisabeth Walton  female
1                      Allison, Master. Hudson Trevor    male
2                        Allison, Miss. Helen Loraine  female
3                Allison, Mr. Hudson Joshua Creighton    male
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
...                                               ...     ...
1304                             Zabour, Miss. Hileni  female
1305                            Zabour, Miss. Thamine  female
1306                        Zakarian, Mr. Mapriededer    male
1307                              Zakarian, Mr. Ortin    male
1308                               Zimmerman, Mr. Leo    male

[1309 rows x 2 columns]

In [ ]:
#slicing rowa is similiar as well
df.loc[2:4,:]

   pclass                                             name  ... embarked  survived
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[3 rows x 11 columns]

In [ ]:
#lets create a simple dataframe 
simple_df=pd.DataFrame({
    'a':[1,2,3,4,5],
    'b':[5,15,10,20,15]})
simple_df['a']
a

3    7
5    6
1    4
6    3
2    3
4    2
0    1
dtype: int64

In [ ]:
#lets extract a series for 'a' and'b'
b=simple_df['b']
b

0     5
1    15
2    10
3    20
4    15
Name: b, dtype: int64

In [ ]:
c=a+b
c

0     6.0
1    19.0
2    13.0
3    27.0
4    17.0
5     NaN
6     NaN
dtype: float64